package warn

import "fmt"

var warn string = `
--------------------------------------------------------------------------------------------------------------
|				  【中华人民共和国网络安全法】 第二十七条  				     |
--------------------------------------------------------------------------------------------------------------
| 	任何个人和组织不得从事非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动       |
| 	不得提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序工具   | 
| 	明知他人从事危害网络安全的活动的，不得为其提供技术支持、广告推广、支付结算等帮助。		     |
--------------------------------------------------------------------------------------------------------------`
var warn2 string = `
					 未授权时，请勿进行渗透测试
`

func Warn() {

	fmt.Print(warn)
	fmt.Println(warn2)
}
